<!-- dflook/terraform-github-actions {"workspace":"default","backend":"a98db11ee3e1e881d813bd54de3667f283985a80643c9d2c8f77c4448bde72b9","backend_type":"s3","plan_job_ref":"Job plan #206 at https://github.com/18F/tts-tech-portfolio/actions/runs/3153775620","plan_hash":"563abfc039a7981661e5136bc3cfd62a4a07fe722c567bd9d3d6ffff7a55ee94","plan_text_format":"text"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 2 to add, 7 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.federalist_users.github_membership.owner["lrussell01"] will be updated in-place
  ~ resource "github_membership" "owner" {
        id       = "federalist-users:lrussell01"
      ~ role     = "member" -> "admin"
        # (2 unchanged attributes hidden)
    }

  # module.repo["aws-admin"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "aws-admin/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["charlie"].github_repository_file.issue_templates["general.md"] will be created
  + resource "github_repository_file" "issue_templates" {
      + branch              = "main"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = <<-EOT
            updated from canonical source
            
            https://github.com/18F/tts-tech-portfolio/blob/main/.github/ISSUE_TEMPLATE/general.md
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
            <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
      + file                = ".github/ISSUE_TEMPLATE/general.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "charlie"
      + sha                 = (known after apply)
    }

  # module.repo["ghad"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "ghad/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["glossary"].github_repository_file.issue_templates["general.md"] will be created
  + resource "github_repository_file" "issue_templates" {
      + branch              = "master"
      + commit_author       = (known after apply)
      + commit_email        = (known after apply)
      + commit_message      = <<-EOT
            updated from canonical source
            
            https://github.com/18F/tts-tech-portfolio/blob/main/.github/ISSUE_TEMPLATE/general.md
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
            <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
      + file                = ".github/ISSUE_TEMPLATE/general.md"
      + id                  = (known after apply)
      + overwrite_on_create = false
      + repository          = "glossary"
      + sha                 = (known after apply)
    }

  # module.repo["newrelic-terraform"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "newrelic-terraform/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["pages-redirects"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "pages-redirects/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["private-eye"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "private-eye/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

  # module.repo["uswds-jekyll"].github_repository_file.issue_templates["general.md"] will be updated in-place
  ~ resource "github_repository_file" "issue_templates" {
      ~ content             = <<-EOT
            ---
            name: General
            about: For general Tech Portfolio work
            title: ""
            labels: "g: initial"
            assignees: ""
            ---
            
            ## Background Information
            
            <!-- Description, links, [user stories](https://www.agilealliance.org/glossary/user-stories/), etc. What is the problem we are trying to solve? If the work is described/tracked elsewhere, feel free to simply link there. Use the [INVEST](https://www.agilealliance.org/glossary/invest) method to assess completeness. -->
            
            ## Implementation Steps
            
            <!-- This is the "how": the steps to get the acceptance criteria fulfilled. They can be filled in and adjusted after the issue is created/groomed. -->
            
            - [ ]
            
            ## Acceptance Criteria
            
          - <!-- Definition of Done. ](https://www.agilealliance.org/glossary/definition-of-done) Should be as objective as possible. -->
          + <!-- [Definition of Done](https://www.agilealliance.org/glossary/definition-of-done). This should be as objective as possible. -->
            
            - [ ]
        EOT
        id                  = "uswds-jekyll/.github/ISSUE_TEMPLATE/general.md"
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 7 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [plan #206](https://github.com/18F/tts-tech-portfolio/actions/runs/3153775620)